{"chunks": ["As a company that prides itself on a family & friends first approach no one is expected to attend calls on days they are not working or out of the office for an official public holiday. We encourage all team members to take time off for public holidays. As a company that values Diversity, Inclusion & Belonging, public holidays will not be pre-loaded to Workday, instead team members have the flexibility to elect different dates and celebrate what’s important to them, as long as they do not exceed the balance in Workday. This means YOU CAN CHOOSE the public holidays you want to take.", "All team members will see a public holiday accrual balance in Workday.\nThe balance is country specific and was determined based on the local and/or contractual requirements.\nBalances are reviewed and updated if appropriate annually, based on benchmarked data for “National Holidays”.*\nThe balance must be used within the calendar year, unused public holiday balances will not rollover to the following calendar year.\nNote *: Contractors of GitLab GSI (previously IT BV) are eligible for general benefits but not entity-specific benefits (including public holidays). However, GitLab has chosen to provide a standardized allocation of 12 public holidays as part of our commitment to supporting all team members. The 12-day allocation matches the weighted average of public holidays globally across countries where team members are employed by GitLab.", "Senior Absence Management Partner\nThe Senior Absence Management Partner reports to Manager, Absence Management.", "Senior Absence Management Partner Job Grade\nThe Senior Absence Management Partner is a grade 7.", "Senior Absence Management Partner Responsibilities\nAdministers global absence management programs and drives policy and practice revisions as needed.\nEnsures compliance with all leave of absence and employment laws across all countries in which we have entities.\nOversees the creation and/or modification of LOA policies and practices to ensure alignment with applicable requirements as well as GitLabs’ Values.\nEnsures alignment with partners across the organization including Legal, Compliance, Sales Operations, Payroll, benefits/leave vendors, and Total Rewards.\nPrimary absence partner and subject matter expert for Global LOA inquiries, requests, designations and approvals.\nHands-on responsibility of day-to-day administration of all employee leave of absence programs.\nMaintains communication with team members on leave to facilitate a smooth departure as well as a smooth transition back to work.\nPartners with leaders and team members regarding workplace accommodations.\nOptimizes the LOA processes to deliver exceptional Team member experiences before, during and after the leave of absence.\nOptimizes the administrative processing of LOA’s to ensure accurate and timely completion of required steps. May be required to determine outsourcing options for administrative aspects of LOA’s.\nProvides trend LOA data and status reports as needed.\nEnsures the proper tracking of LOA’s and identifies the process dependencies and remediation of those dependencies.\nSenior Absence Management Partner Requirements\n5-7+ years of progressive Absence Management experience.\nExpert level knowledge of leave requirements and regulations in multiple countries including US and Canada. Must have the willingness and desire to learn other countries’ requirements. Excellent written and verbal communication and interpersonal skills.\nStrong problem-solving skills, critical thinking, and an intuitive sense of business acumen.\nAbility to execute tasks with attention to detail, reliability, and a relatively quick pace.\nAbility to interface and partner with stakeholders to achieve and influence results.", "Sick Time\nThis policy outlines GitLab’s approach to sick time for all team members. It is designed to complement, not replace, any statutory sick leave policies you may be eligible for in your country of residence. Team members are encouraged to familiarize themselves with their location’s statutory reporting requirements and entitlements in their respective handbook sections.", "Overview\nGitLab’s sick time policy supports team members who need time away to recover from illness. This policy aligns with our CREDIT values.", "Sick time refers to time away needed to recover from short-term illness or for preventative care.\nThis includes personal illness (such as COVID-19, cold/flu, menstrual pain, surgery).\nBut what if I need to care for an ill family member? Please follow the Caregiver Sick Time Policy.\nExcept where required by applicable local law, GitLab’s sick time does not get paid out in case of termination, nor does it reduce your final paycheck in case of a negative balance.\nSick Time Eligibility and Coverage\nGitLab’s Sick Time policy is administered concurrently with any statutory sick leave for which you may be eligible.\nEach GitLab team member may use up to 25 paid sick days, available from their first day of work. Eligibility is calculated on a rolling 12-month period.\nWhat does a rolling 12-month period mean? A rolling 12-month calendar refers to a period that always spans exactly 12 consecutive months, but continuously shifts forward as time passes, so the start and end dates move forward together while maintaining a constant 12-month"], "metas": [{"chunk_id": 0, "source": "data\\real_world_policies\\public_holiday.txt", "chunk_index_in_doc": 0, "text_preview": "As a company that prides itself on a family & friends first approach no one is expected to attend calls on days they are not working or out of the office for an official public holiday. We encourage a"}, {"chunk_id": 1, "source": "data\\real_world_policies\\public_holiday.txt", "chunk_index_in_doc": 1, "text_preview": "All team members will see a public holiday accrual balance in Workday. The balance is country specific and was determined based on the local and/or contractual requirements. Balances are reviewed and "}, {"chunk_id": 2, "source": "data\\real_world_policies\\senior_manager.txt", "chunk_index_in_doc": 0, "text_preview": "Senior Absence Management Partner The Senior Absence Management Partner reports to Manager, Absence Management."}, {"chunk_id": 3, "source": "data\\real_world_policies\\senior_manager.txt", "chunk_index_in_doc": 1, "text_preview": "Senior Absence Management Partner Job Grade The Senior Absence Management Partner is a grade 7."}, {"chunk_id": 4, "source": "data\\real_world_policies\\senior_manager.txt", "chunk_index_in_doc": 2, "text_preview": "Senior Absence Management Partner Responsibilities Administers global absence management programs and drives policy and practice revisions as needed. Ensures compliance with all leave of absence and e"}, {"chunk_id": 5, "source": "data\\real_world_policies\\sick_leave.txt", "chunk_index_in_doc": 0, "text_preview": "Sick Time This policy outlines GitLab’s approach to sick time for all team members. It is designed to complement, not replace, any statutory sick leave policies you may be eligible for in your country"}, {"chunk_id": 6, "source": "data\\real_world_policies\\sick_leave.txt", "chunk_index_in_doc": 1, "text_preview": "Overview GitLab’s sick time policy supports team members who need time away to recover from illness. This policy aligns with our CREDIT values."}, {"chunk_id": 7, "source": "data\\real_world_policies\\sick_leave.txt", "chunk_index_in_doc": 2, "text_preview": "Sick time refers to time away needed to recover from short-term illness or for preventative care. This includes personal illness (such as COVID-19, cold/flu, menstrual pain, surgery). But what if I ne"}]}